Функция СведенияОВнешнейОбработке() Экспорт
    ПараметрыРегистрации = Новый Структура;
    ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
    ПараметрыРегистрации.Вставить("Наименование", "Инструменты разработчика для управляемых форм");
    ПараметрыРегистрации.Вставить("Версия", "1.0.2");
    ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
    ПараметрыРегистрации.Вставить("Информация", "Инструменты разработчика для управляемых форм");
	
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	ПараметрыРегистрации.Вставить("Команды", тзКоманд);
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = "Инструменты разработчика для управляемых форм";
	Команда.Представление = "Инструменты разработчика для управляемых форм";
	Команда.ПоказыватьОповещение = Истина;
	Команда.Использование = "ОткрытиеФормы";
	
	
    Возврат ПараметрыРегистрации;
КонецФункции