
&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Значение) Тогда 
		ЗначениеПриИзмененииСервер();	
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ЗначениеПриИзмененииСервер()
	/// странно - зачем надо вызывать этот метод ну да фиг с ним....
	
	ИсторияДанных.ОбновитьИсторию();
	
	/// 
	
	
	ТД = ИсторияДанных.ВыбратьВерсии(Новый Структура("Данные",Значение));	
	
	ИсторияВерсий.Очистить();
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных  = Новый ОписаниеИсточникаДанных(ТД);
	Построитель.Вывести(ИсторияВерсий);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИсторию(Команда)
	Если ЗначениеЗаполнено(Значение) Тогда 
		ЗначениеПриИзмененииСервер();	
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры
