
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	
	ТекСтрока = ЭтаФорма.Элементы.Процедуры.ТекущиеДанные;
	_п = новый Структура;
	Для Каждого Стр из ТекСтрока.Параметры Цикл
		_п.Вставить(Стр.Имя,Стр.ЗначениеПоУмолчанию);
	КонецЦикла;
	
	Если ТекСтрока.Сервер Тогда 	
		ВыполнитьНаСервере(ТекСтрока.Код,_п);
	Иначе
		ВыполнитьКод(ТекСтрока.Код,_п);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ВыполнитьКод(_Код,_Параметры)
	__ДанныеВозвратРезультат = Неопределено;

	КОД = "";
	Для Каждого _Параметр из _Параметры Цикл
		КОД = КОД + _Параметр.Ключ + " = _Параметры." + _Параметр.Ключ + ";" +  Символы.ПС;
	КонецЦикла;
	КОД = КОД + "_Параметры = Неопределено;" +  Символы.ПС;
	
	КОД = КОД + Символы.ПС + _Код;
	Выполнить(КОД);
	
	
	~Конец: 
	Если ЗначениеЗаполнено(__ДанныеВозвратРезультат) Тогда 		
		Сообщить(__ДанныеВозвратРезультат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере(_Код,_Параметры)
	__ДанныеВозвратРезультат = Неопределено;

	КОД = "";
	Для Каждого _Параметр из _Параметры Цикл
		КОД = КОД + _Параметр.Ключ + " = _Параметры." + _Параметр.Ключ + ";" +  Символы.ПС;
	КонецЦикла;
	КОД = КОД + "_Параметры = Неопределено;" +  Символы.ПС;
	
	КОД = КОД + Символы.ПС + _Код;
	Выполнить(КОД);
	
	
	~Конец: 
	Если ЗначениеЗаполнено(__ДанныеВозвратРезультат) Тогда 		
		Сообщить(__ДанныеВозвратРезультат);
	КонецЕсли;
КонецПроцедуры

//@skip-warning
&НаСервере
Функция ПолучитьНаСерввере(Строка)
	Возврат ЗначениеИзСтрокиВнутр(Строка);
КонецФункции

&НаКлиенте
Процедура ПроцедурыПриИзменении(Элемент)
	ПроцедурыПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ПроцедурыПриИзмененииСервер()
	
	ХранилищеНастроекДанныхФорм.Сохранить("Объект", "Процедуры", РеквизитФормыВЗначение("Процедуры"));

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		ЗначениеВРеквизитФормы(ХранилищеНастроекДанныхФорм.Загрузить("Объект", "Процедуры"),"Процедуры");
	Исключение
		Сообщить("не получилоз загрузить предыдущие версии");
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПроцедурыПараметрыПриАктивизацииСтроки(Элемент)
	Попытка 
		Элементы.ПроцедурыПараметрыЗначениеПоУмолчанию.ДоступныеТипы = Элементы.ПроцедурыПараметры.ТекущиеДанные.Типы;
		Элементы.ПроцедурыПараметрыЗначениеПоУмолчанию.ОграничениеТипа = Элементы.ПроцедурыПараметры.ТекущиеДанные.Типы;
		Элементы.ПроцедурыПараметрыЗначениеПоУмолчанию.СписокВыбора.ТипЗначения = Элементы.ПроцедурыПараметры.ТекущиеДанные.Типы;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПроцедурыПараметрыТипыПриИзменении(Элемент)
	Элементы.ПроцедурыПараметрыЗначениеПоУмолчанию.ДоступныеТипы = Элементы.ПроцедурыПараметры.ТекущиеДанные.Типы;
	Элементы.ПроцедурыПараметрыЗначениеПоУмолчанию.ОграничениеТипа = Элементы.ПроцедурыПараметры.ТекущиеДанные.Типы;
	Элементы.ПроцедурыПараметрыЗначениеПоУмолчанию.СписокВыбора.ТипЗначения = Элементы.ПроцедурыПараметры.ТекущиеДанные.Типы;
	
	Элементы.ПроцедурыПараметры.ТекущиеДанные.ЗначениеПоУмолчанию = Элементы.ПроцедурыПараметры.ТекущиеДанные.Типы.ПривестиЗначение(Элементы.ПроцедурыПараметры.ТекущиеДанные.ЗначениеПоУмолчанию);
КонецПроцедуры
