
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДМ = РеквизитФормыВЗначение("ДеревоМетаданных");
	ДобавитьКорневуюТаблицу(ДМ,Метаданные.Справочники,"Справочник",БиблиотекаКартинок.Справочник);	
	ДобавитьКорневуюТаблицу(ДМ,Метаданные.Документы,"Документ",БиблиотекаКартинок.Документ);
	ДобавитьРегистрыСведений(ДМ);
	ДобавитьКорневуюТаблицу(ДМ,Метаданные.Задачи,"Задача",БиблиотекаКартинок.Задача);
	ДобавитьКорневуюТаблицу(ДМ,Метаданные.БизнесПроцессы,"БизнесПроцесс",БиблиотекаКартинок.БизнесПроцесс);
	ЗначениеВРеквизитФормы(ДМ,"ДеревоМетаданных");
КонецПроцедуры

&НаСервере
Процедура ДобавитьРегистрыСведений(ДеревоМетеданных)
	СтрокаМетаданное = ДеревоМетеданных.Строки.Добавить();
	СтрокаМетаданное.Метаданное = "РегистрСведений";	
	СтрокаМетаданное.ПолноеИмя = "РегистрСведений";	
	СтрокаМетаданное.Картинка = БиблиотекаКартинок.РегистрСведений;
	
	
	Для Каждого РегистрСведений из Метаданные.РегистрыСведений Цикл
		СтрокаРС = ДобавитьТаблицу(СтрокаМетаданное,РегистрСведений.Имя,БиблиотекаКартинок.РегистрСведений);
		
		Для Каждого Измерение из РегистрСведений.Измерения Цикл
			ДобавитьРеквизит(СтрокаРС, Измерение.Имя,БиблиотекаКартинок.Измерение);
		КонецЦикла;
		
		
		Для Каждого Ресурс из РегистрСведений.Ресурсы Цикл
			ДобавитьРеквизит(СтрокаРС, Ресурс.Имя,БиблиотекаКартинок.Ресурс);
		КонецЦикла;
		
		
		Для Каждого Реквизит из РегистрСведений.Реквизиты Цикл
			ДобавитьРеквизит(СтрокаРС, Реквизит.Имя,БиблиотекаКартинок.Реквизит);
		КонецЦикла;
			
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКорневуюТаблицу(ДеревоМетеданных,МетаданноеКоллекция,ИмяТаблицы,Картинка)
	СтрокаМетаданное = ДеревоМетеданных.Строки.Добавить();
	СтрокаМетаданное.Метаданное = ИмяТаблицы;	
	СтрокаМетаданное.ПолноеИмя = ИмяТаблицы;	
	СтрокаМетаданное.Картинка = Картинка;
		
	Для Каждого ЭлементКоллекцииМетаданного из МетаданноеКоллекция Цикл
		СтркаЭлемента = ДобавитьТаблицу(СтрокаМетаданное,ЭлементКоллекцииМетаданного.Имя,Картинка);		
		Для Каждого Реквизит из ЭлементКоллекцииМетаданного.СтандартныеРеквизиты Цикл
			ДобавитьРеквизит(СтркаЭлемента,Реквизит.Имя,БиблиотекаКартинок.Реквизит)
		КонецЦикла;
		Для Каждого Реквизит из ЭлементКоллекцииМетаданного.Реквизиты Цикл
			ДобавитьРеквизит(СтркаЭлемента,Реквизит.Имя,БиблиотекаКартинок.Реквизит)
		КонецЦикла;
		
		Для Каждого ОбщийРеквизит из Метаданные.ОбщиеРеквизиты Цикл
			НайденнаяСтрока = ОбщийРеквизит.Состав.Найти(ЭлементКоллекцииМетаданного);
			Если НайденнаяСтрока <> Неопределено и 
				(
				(
				НайденнаяСтрока.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто 
				и ОбщийРеквизит.АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать
				)  
				или НайденнаяСтрока.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать
				) Тогда
				ДобавитьРеквизит(ЭлементКоллекцииМетаданного,ОбщийРеквизит.Имя,БиблиотекаКартинок.Ресурс)
			КонецЕсли;
		КонецЦикла;
		
		ЭлементКоллекцииМетаданного = Метаданные.РегистрыСведений.Получить(0);
						
		Попытка
			Для Каждого ТабличнаяЧасть из ЭлементКоллекцииМетаданного.ТабличныеЧасти Цикл
				СтркаТЧ = ДобавитьТаблицу(СтркаЭлемента,ТабличнаяЧасть.Имя,БиблиотекаКартинок.ВложеннаяТаблица);
				
				Для Каждого Реквизит из ТабличнаяЧасть.СтандартныеРеквизиты Цикл
					ДобавитьРеквизит(СтркаТЧ,Реквизит.Имя,БиблиотекаКартинок.Реквизит)
				КонецЦикла;
				Для Каждого Реквизит из ТабличнаяЧасть.Реквизиты Цикл
					ДобавитьРеквизит(СтркаТЧ,Реквизит.Имя,БиблиотекаКартинок.Реквизит)
				КонецЦикла;
			КонецЦикла;
		Исключение;
		КонецПопытки;
		ДобавитьРеквизит(СтркаЭлемента,"ВерсияДанных",БиблиотекаКартинок.Реквизит);
		ДобавитьРеквизит(СтркаЭлемента,"Представление",БиблиотекаКартинок.Реквизит);
		
		Попытка
			ЗапросСправочник = Новый Запрос;
			ЗапросСправочник.Текст = 
			"ВЫБРАТЬ
			|	ИмяПредопределенныхДанных
			|ИЗ
			|	" + ЭлементКоллекцииМетаданного.ПолноеИмя() + "
			|ГДЕ
			|	Предопределенный";
			Выб = ЗапросСправочник.Выполнить().Выбрать();
			Пока Выб.Следующий() Цикл
				ДобавитьРеквизит(СтркаЭлемента, Выб.ИмяПредопределенныхДанных,БиблиотекаКартинок.Перечисление,Истина);
			КонецЦикла;	
		Исключение;
		КонецПопытки;
	КонецЦикла;			
КонецПроцедуры

Функция ДобавитьРеквизит(Строка,Имя,Картинка, Значение = Ложь)
	ТекСтрока = Строка.Строки.Добавить();
	ТекСтрока.Метаданное = Имя;
	ТекСтрока.Картинка = Картинка;
	ТекСтрока.Таблица = Ложь;
	ТекСтрока.ПолноеИмя = Имя; 
	ТекСтрока.Значение = Значение;
	Возврат ТекСтрока;	
КонецФункции

Функция ДобавитьТаблицу(Строка,Имя,Картинка)
	ТекСтрока = Строка.Строки.Добавить();
	ТекСтрока.Метаданное = Имя;
	ТекСтрока.Картинка = Картинка;
	ТекСтрока.Таблица = истина;
	ТекСтрока.ПолноеИмя = ТекСтрока.Родитель.ПолноеИмя + "." + Имя; 
	Возврат ТекСтрока;	
КонецФункции