
&НаСервере
Процедура ДокументПриИзмененииНаСервере(Документ)
	
	ТабДок.Очистить();
	
	Если Документ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	
	Для Каждого Стр из ДокументОбъект.Движения Цикл 	
		Построитель = Новый ПостроительОтчета;
		Стр.Прочитать();	
		Если Стр.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Построитель.ТекстЗаголовка= СтрРазделить(Строка(Стр),".")[1];
		Построитель.ИсточникДанных  = Новый ОписаниеИсточникаДанных(Стр.Выгрузить());
		Построитель.Вывести(ТабДок);
	КонецЦикла;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	ДокументПриИзмененииНаСервере(Документ);
КонецПроцедуры
